import time  #导入time模块

song = '''
[00:03.50]传奇
[00:19.10]作词：刘兵 作曲：李健
[00:20.60]演唱：王菲
[00:26.60]
[04:40.75][02:39.90][00:36.25]只是因为在人群中多看了你一眼
[04:49.00]
[02:47.44][00:43.69]再也没能忘掉你容颜
[02:54.83][00:51.24]梦想着偶然能有一天再相见
[03:02.32][00:58.75]从此我开始孤单思念
[03:08.15][01:04.30]
[03:09.35][01:05.50]想你时你在天边
[03:16.90][01:13.13]想你时你在眼前
[03:24.42][01:20.92]想你时你在脑海
[03:31.85][01:28.44]想你时你在心田
[03:38.67][01:35.05]
[04:09.96][03:39.87][01:36.25]宁愿相信我们前世有约
[04:16.37][03:46.38][01:42.47]今生的爱情故事 不会再改变
[04:24.82][03:54.83][01:51.18]宁愿用这一生等你发现
[04:31.38][04:01.40][01:57.43]我一直在你身旁 从未走远
[04:39.55][04:09.00][02:07.85]
'''

#自定义歌词解析函数
def song_show(str):
    # 用来储存[时间：歌词]键值对的字典
    Dict = {}
    #strip函数去除str两边空格，splitlines函数将字符串str按行进行分割
    myList = str.strip().splitlines()
    #遍历每一行
    for line in myList:
        #将每一行用']'符号进行分割
        lineList = line.split(']')
        #遍历歌词前的时间信息
        for i in lineList[:-1]:
            #将时间信息去除'['，并以':'进行分割
            TimeList = i.strip('[').split(':')
            #将分割后的时间列表整合成浮点数时间
            Time = float(TimeList[0])*60+float(TimeList[1])
            #将时间对应的歌词存入字典中
            Dict[Time] = lineList[-1]
    #将存储时间的列表timeList进行冒泡排序
    timeList = list(Dict)
    timeList.sort()
    #循环遍历,根据前后时间差得到应该停顿的时间
    for k in range(len(timeList)):
        if k == 0:
            time.sleep(timeList[k]/5)
        else:
            time.sleep((timeList[k]-timeList[k-1])/5)
        #输出对应时间上的歌词信息
        print(Dict.get(timeList[k]))

#调用函数
song_show(song)